app/controllers/plays_controller.rb

SELECT "scripts".* FROM "scripts" WHERE "scripts"."user_id" = ?  [["user_id", 1]]
SELECT  1 AS one FROM "scripts" WHERE "scripts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."script_id" = ?  [["script_id", 1]]
---
  def index
    dbScript = Script.where(user_id: 1)
    if (dbScript.empty?)
      @hasText = false
    else

      @filename = File.join(Rails.root, "/public/uploads/" + dbScript[0].filename)
    	@projectName = dbScript[0].script_name
      #send_file(filename, :filname => "sample.pdf", :type => "application/pdf", disposition: "inline")
    	reader = PDF::Reader.new(@filename)
    	puts reader.pdf_version
      puts reader.info
      puts reader.metadata
      puts reader.page_count
      @text = ""
      reader.pages.each do |page|
        # puts page.fonts
        # puts page.text
        @text += page.text
        # puts page.raw_content
    	end
    	@hasText = true
      @cues = Note.where(script_id: dbScript[0].id)

SELECT "scripts".* FROM "scripts" WHERE "scripts"."user_id" = ?  [["user_id", 1]]
SELECT  "scripts".* FROM "scripts" WHERE "scripts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "scripts" WHERE "scripts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 7]]
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."script_id" = ? AND "notes"."location" = ? AND "notes"."lineNum" = ?  [["user_id", 1], ["script_id", 1], ["location", 5], ["lineNum", 23]]
INSERT INTO "notes" ("script_id", "user_id", "created_at", "updated_at", "lineNum", "location", "cueType", "cueLabel", "cueDescription") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def cuesDB
    dbScript = Script.where(user_id: 1)
    if (dbScript.empty?)
      render json: {"Failure" => "'You have no arms or legs!' 'Its just a flesh wound'"}
    else
      cues = []
      Note.where(user_id: 1, script_id: dbScript[0].id, location: params[:location], lineNum: params[:cueLineNum]).destroy_all
      for i in 0...params[:cueType].length do
        if (params[:cueType][params[:cueType].length-1-i] != "" ||  params[:cueLabel][params[:cueLabel].length-1-i] != "" || params[:cueDescription][params[:cueDescription].length-1-i] != "")
          cuesLink = Note.new(
          user_id: 1,
          script_id: dbScript[0].id,
          cueType: params[:cueType][params[:cueType].length-1-i],
          cueLabel: params[:cueLabel][params[:cueLabel].length-1-i],
          cueDescription: params[:cueDescription][params[:cueDescription].length-1-i],
          location: params[:location],
          lineNum: params[:cueLineNum])
        end
        if (cuesLink.save)