app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "username", "first_name", "last_name", "phone", "created_at", "updated_at", "encrypted_password", "remember_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)